Mermaid on docs
